In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 22, 0, 3, 52, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 22, 0, 9, 10, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 22, 0, 12, 6, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 22, 0, 15, 41, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 22, 0, 23, 40, 796000), 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(15, 'Lily', 'Koch', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (50, 'Ava', 'Robinson', 'F', 'free'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (63, 'Ayla', 'Johnson', 'F', 'free')]

### %sql SELECT * FROM songs LIMIT 5;

In [5]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', nan, nan)]

In [6]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 22, 0, 3, 52, 796000), 0, 22, 47, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 22, 0, 9, 10, 796000), 0, 22, 47, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 22, 0, 12, 6, 796000), 0, 22, 47, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 22, 0, 15, 41, 796000), 0, 22, 47, 11, 2018, 'Thursday'),
 (datetime.datetime(2018, 11, 22, 0, 23, 40, 796000), 0, 22, 47, 11, 2018, 'Thursday')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).